README.md
- [[event-registration](https://github.com/haoxiangliew/event-registration)](#org76a5856)
  - [Installation](#org423e081)
    - [Prerequisites](#org9a60b7c)
    - [Linux](#org5636df9)
    - [Windows](#org24fda82)
    - [MacOS](#org402a375)
  - [Specifications](#org968a511)
    - [Scanner](#orgd0cd029)
    - [IDs](#org13c8a77)
    - [Application](#org4714770)



<a id="org76a5856"></a>

# [event-registration](https://github.com/haoxiangliew/event-registration)

This is a custom app for Virgnia Tech student organizations to take in a spreadsheet and confirm the scanned individual is registered.

App was made specifically for [IEEE@VT](https://ieee.vt.edu)'s Happy Hour, hello there!


<a id="org423e081"></a>

## Installation


<a id="org9a60b7c"></a>

### Prerequisites

-   [Python 3+](https://www.python.org/downloads/)
-   Make sure Python is configured for [TKinter](https://tkdocs.com/tutorial/install.html)
    -   Linux: Search your repositories for python-tk / tkinter
    -   Windows: Official Distribution
    -   MacOS: Official Distribution / `brew install python-tk` (Homebrew)


<a id="org5636df9"></a>

### Linux

```sh
python3 -m venv ./venv
source ./venv/bin/activate
pip3 install -r requirements.txt
python3 main.py
```


<a id="org24fda82"></a>

### Windows

```sh
python -m venv ./venv
.\venv\Scripts\Activate.ps1
pip install -r requirements.txt
python main.py
```


<a id="org402a375"></a>

### MacOS

Using the shell, the Linux instructions should work perfectly


<a id="org968a511"></a>

## Specifications


<a id="orgd0cd029"></a>

### Scanner

-   The scanner is sourced from thesource@vt.edu
    -   [Scan Technology Inc. 4000M-DBU6](https://store-scantec.com/Search/ProductView.aspx?partid=222567983)
        -   Scanning an ID results with the following as USB keyboard input:
            
            ```sh
            ;"9-digit ID"=0249?
            "\n"
            ```
        -   Scanner can be inaccurate at times, note scanning speed can't be too fast or too slow.


<a id="org13c8a77"></a>

### IDs

-   9-digits.
-   Presume the last 4-digits are unique.
    -   If for some edge case, there are duplicate IDs, prompt for a name search of those entries.


<a id="org4714770"></a>

### Application

-   Dependencies

```sh
openpyxl
pandas
tk
```

-   Takes in `input.xlsx`, with the first-row as categories.
    -   Should have no duplicate ID and names.
-   Filter input for scanner and manual input automatically.
-   `tkinter` popups can be dismissed quickly with `<RET>`.